using System;

namespace _03._Histogram
{
    class Program
    {
        static void Main(string[] args)
        {
            //четем какъв е броя на числата, които ще прочетем от конзолата
            int n = int.Parse(Console.ReadLine());

            //Създаваме променливи за всяка от групите
            // => ще пазим броя на числата, които са попаднали в съответната група
            double p1 = 0;
            double p2 = 0;
            double p3 = 0;
            double p4 = 0;
            double p5 = 0;

            int num;
            //пускаме цикъл, който върти от 1вото до последното число вкл. (n)
            for (int i = 1; i <= n; i++)
            {
                //Всеки път четем число
                num = int.Parse(Console.ReadLine());

                //Проверяваме числото в коя група е: 
                //=> увеличаваме броя на числата в съответната група с 1

                //  p1 => числа по-малки от 200 (num < 200 ) 
                if (num < 200)
                {
                    p1++;
                }
                //  p2 => числа му 200 и 399 вкл. ( num >= 200 && num<=399 )
                else if (num <= 399)
                {
                    p2++;
                }
                //  p3 => числа му 400 и 599 вкл. ( num >= 400 && num<=599 )
                else if (num <= 599)
                {
                    p3++;
                }
                //  p4 => числа му 600 и 799 вкл. ( num >= 600 && num<=799 )
                else if (num <= 799)
                {
                    p4++;
                }
                //  p5 => числа пo-големи или равни на 800 (num >= 800 )
                else
                {
                    p5++;
                }
            }

            //Когато сме прочели всички числа и сме ги разпределили в съответните групи, трябва да намерим
            // във всяка от групите какъв % от числата са попаднали: % = броя числа в групата / общия брой числа * 100
            p1 = p1 / n * 100;
            p2 = p2 / n * 100;
            p3 = p3 / n * 100;
            p4 = p4 / n * 100;
            p5 = p5 / n * 100;

            Console.WriteLine($"{p1:f2}%");
            Console.WriteLine($"{p2:f2}%");
            Console.WriteLine($"{p3:f2}%");
            Console.WriteLine($"{p4:f2}%");
            Console.WriteLine($"{p5:f2}%");

        }
    }
}

